# coding: utf-8
                                       p$$&&
                                       %%%&&
       ('';)<?!                        ||l||
コニア画コニア画コニア画コニア画コニア ||l||
コニア画コニア画コニア画コニア画コニア ||l||
H                                      ||l||
H=('' )...( '')                        ||l||
画アニコ画アニコ画アニコ画アニコ画アニ ||l||
画アニコ画アニコ画アニコ画アニコ画アニ ||l||
                                    H  ||l||
                                    H  ||l||
コニア画コニア画コニア画コニア画コニア ||l||
コニア画コニア画コニア画コニア画コニア ||l||
H                                      ||l||
H                                      ||l||
画アニコ画アニコ画アニコ画アニコ画アニ ||l||
画アニコ画アニコ画アニコ画アニコ画アニ ||l||
                                    H  ||l||
                ((;_; )...( ;_;))<!?H  ||l||
コニア画コニア画コニア画コニア画コニア ||l||
コニア画コニア画コニア画コニア画コニア ||l||
H                                          ||l||
H<<(;_;)/ -------------~~~~~~~~+++++++++++++0   ||l||
画アニコ画アニコ画アニコ画アニコ画アニ      ||l||
画アニコ画アニコ画アニコ画アニコ画アニ ||l||____________________________